# Importing libraries

In [1]:
# Import pandas, NumPy, os
import pandas as pd
import numpy as np
import os

# Project folder path

In [2]:
path = r'/Users/cleberjulianoferrareze/Documents/CareerFoundry/Achievement 4/Task 4.5/2021-08 - 4.5 Instacart Grocery Basket'

In [3]:
path

'/Users/cleberjulianoferrareze/Documents/CareerFoundry/Achievement 4/Task 4.5/2021-08 - 4.5 Instacart Grocery Basket'

# Importing data - products dataset

In [4]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'))

# Finding null values - products dataset

In [13]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [16]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [17]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [21]:
df_prods.shape

(49693, 5)

In [19]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [23]:
df_prods_clean.shape

(49677, 5)

# Finding duplicates - products dataset

In [24]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [25]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

# Addressing duplicates - products dataset

In [26]:
df_prods_clean.shape

(49677, 5)

In [29]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [31]:
df_prods_clean_no_dups.shape

(49672, 5)

# Exporting data - products dataset

In [32]:
df_prods.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_wrangled.csv'))

# Task 4.5 - from Step 2

# 2. Investigating further - products dataset - min and max values!

In [33]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [34]:
df_prods_clean_no_dups.describe()

         product_id      aisle_id  department_id        prices
count  49672.000000  49672.000000   49672.000000  49672.000000
mean   24850.349775     67.762442      11.728942      9.993282
std    14340.705287     38.315784       5.850779    453.615536
min        1.000000      1.000000       1.000000      1.000000
25%    12432.750000     35.000000       7.000000      4.100000
50%    24850.500000     69.000000      13.000000      7.100000
75%    37268.250000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  99999.000000

In [ ]:
# Products dataset with no duplicate values
# There are 49672 values, the minimum price is 1, the maximum 99999 and the mean 9.99. 
# My new dataframe has exactly 16 less rows than the original dataframe, the same as the number of missing values.
# The original products dataframe had 49693 rows, 5 columns, removing the 16 missing values, it had 49677 rows, 
# and 5 columns, removing 5 duplicates values, the final dataset now has 49672 rows with the same 5 columns.
# The min, max, mean values have not changed significantly between the dataset versions.

# Create a dataframe - df_test

In [56]:
df_test = pd.DataFrame()

# Create a mixed type column - df_test

In [57]:
df_test['mix'] = ['a', 'b', 1, True]

In [58]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

# Checking for mixed type columns - df_test

In [59]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [60]:
df_test['mix'] = df_test['mix'].astype('str')

In [61]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

# Importing data - orders dataset (wrangled)

In [62]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'))

In [63]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

# 3. Checking data - mixed-type data - orders dataframe

In [72]:
df_ords.shape

(3421083, 8)

In [67]:
for col in df_ords.columns.tolist():
    weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_ords[weird]) > 0:
        print(col)

In [ ]:
# No mixed-type values found in the df_ords dataframe

# Finding missing values - orders dataframe

In [69]:
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

# Finding & addressing duplicates values - orders dataframe

In [93]:
df_ords_no_dups = df_ords[df_ords['days_since_prior_order'].isnull() == False]

In [95]:
df_ords_no_dups.shape

(3214874, 8)

In [96]:
3421083 - 3214874

206209

In [99]:
206209 / 3421083

0.06027594185817766

In [100]:
df_ords.median()

Unnamed: 0                1710541.0
order_id                  1710542.0
user_id                    102689.0
order_number                   11.0
order_dow                       3.0
order_hour_of_day              13.0
days_since_prior_order          7.0
dtype: float64

In [101]:
df_ords_no_dups.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
1,1,2398795,1,prior,2,3,7,15.0
2,2,473747,1,prior,3,3,12,21.0
3,3,2254736,1,prior,4,4,7,29.0
4,4,431534,1,prior,5,4,15,28.0
5,5,3367565,1,prior,6,2,7,19.0

In [102]:
df_ords_no_dups_unnamed = df_ords_no_dups.drop(columns = ['Unnamed: 0'])

In [103]:
df_ords_no_dups_unnamed.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0
5,3367565,1,prior,6,2,7,19.0

In [ ]:
# 206209 missing values for the "days_since_prior_order" field
# 94% of the total have a unique order. It means that a massive number of customers buy only once.
# Many missing values found in the "days_since_prior_order" (6% of the total orders). 
# There is a logic behind that because, if a customer
# has not had a previous order, it will be a missing value in the dataset.
# I would address missing values adding the median (7) for the days_since_prior_order
# Removed unnamed column

# Exporting data - orders dataframe

In [104]:
df_ords_no_dups_unnamed.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_cleaned.csv'))